#include "图形工厂.h"
#include "游戏.h"
#include "程序.h"
namespace 东方山寨 {
//==============================================================================
// 参数
//==============================================================================
S图形参数 S图形参数::c默认 = S图形参数();
S图形参数 S图形参数::c界面 = c默认;
S图形参数 S图形参数::c游戏中 = []()->S图形参数 {
	S图形参数 v;
	v.m标志[I图形::e游戏中] = true;
	return v;
}();
S图形参数 S图形参数::c游戏抬显 = []()->S图形参数 {
	S图形参数 v;
	v.m标志[I图形::e游戏中] = true;
	v.m图层 = (int)E图层::e抬显;
	return v;
}();
S图形参数 S图形参数::fc自动() {
	S图形参数 v;
	const E游戏状态 v游戏状态 = C程序::fg游戏状态();
	if (v游戏状态 == E游戏状态::e游戏中) {
		v.m标志[I图形::e游戏中] = true;
	}
	return v;
}
//==============================================================================
// 工厂
//==============================================================================
void C图形工厂::f初始化_环境(const C游戏速度 &a速度) {
	m游戏速度 = &a速度;
}
void C图形工厂::f初始化_数组(C对象数组<I图形> &aa图形对象, C缓冲数组<I图形缓冲> &aa图形缓冲) {
	ma图形 = &aa图形对象;
	ma图形缓冲 = &aa图形缓冲;
}
void C图形工厂::f产生图形0(const std::shared_ptr<I图形> &a指针, S图形参数 &a参数, I图形缓冲 *a缓冲) const {
	if constexpr (c调试) {	//调试期检查
		if (a参数.m图层 == 0) {
			throw std::runtime_error("未指定图层");
		}
		if (a缓冲 == nullptr) {
			throw std::runtime_error("没有图形缓冲");
		}
	}
	I图形 *const v图形 = a指针.get();
	//编译参数
	if (a参数.m纹理.fi需编译()) {
		auto &va纹理 = C游戏::fg图形().fg纹理();
		va纹理.f编译(a参数.m纹理);
	}
	if (a参数.m顶点.fi需编译()) {
		auto &va顶点 = C游戏::fg图形().fg顶点矩形();
		va顶点.f编译(a参数.m顶点);
	}
	//赋值
	if (a缓冲) {
		v图形->m图形缓冲 = a缓冲;
		a缓冲->m图层 = a参数.m图层;
	}
	v图形->m游戏速度 = m游戏速度;
	v图形->m计数指针 = &ma图形->m计数;
	v图形->f接口_初始化(a参数);
	//结束
	v图形->f对象_使用();
	ma图形->f添加(a指针);
}
bool C图形工厂::fi有空() const {
	return ma图形->fi有空();
}
std::shared_ptr<I图形> C图形工厂::f产生图形(S图形参数 &a图形参数, const I图形建造机 &a建造) const {
	using t过程 = C图形建造过程;
	if (fi有空()) {
		t过程 v过程;
		a建造.f接口_建造图形(v过程);
		a建造.f接口_建造图形缓冲(v过程);
		f产生图形0(v过程.m图形, a图形参数, v过程.m图形缓冲.get());
		ma图形缓冲->f添加(std::move(v过程.m图形缓冲));
		return v过程.m图形;
	}
	return nullptr;
}
//==============================================================================
}	//namespace 东方山寨