#include "图形基础.h"
#include "图形引擎.h"
#include "游戏.h"
#include "图形工厂.h"
namespace 东方山寨 {
//==============================================================================
// I图形
//==============================================================================
void I图形::f接口_计算() {
}
void I图形::f接口_更新() {
}
void I图形::f接口_初始化(const S图形参数 &a参数) {
}
bool I图形::f接口_i可销毁() const {
	return m标志[e结束];
}
void I图形::f对象_使用() {
	m标志[e使用] = true;
	m计数指针->f加计数();
}
void I图形::f对象_销毁() {
	m标志.reset();
	m图形缓冲->f对象_销毁();
	m计数指针->f减计数();
}
bool I图形::f对象_i使用() {
	return m标志[e使用];
}
void I图形::f动作_结束() {
	m标志[e结束] = true;
}
//==============================================================================
// 粒子
//==============================================================================
void I粒子::f接口_初始化(const S图形参数 &a参数) {
	I图形::f接口_初始化(a参数);
	f初始化_运动(a参数.m坐标, a参数.m速度);
	f初始化_生命(a参数.m寿命);
}
bool I粒子::f接口_i可销毁() const {
	return fi死亡();
}
void I粒子::f计算_运动() {
	S运动::f计算_运动(m游戏速度->fg秒());
}
void I粒子::f计算_生命() {
	S生命::f计算_生命(m游戏速度->fg秒());
}
}	//namespace 东方山寨