#include "图形_画边框.h"
#include "图形引擎.h"
#include "游戏常量.h"
#include "边框常量.h"
import 东方山寨.抬显;
namespace 东方山寨 {
constexpr float c边框透明度 = 0.6f;
//==============================================================================
// 画边框
//==============================================================================
C画边框::C画边框(C图形引擎 &, 二维::C二维 &a二维) :
	m画图形(a二维.fc画图形()) {
	m画图形->fs颜色(t颜色(1, 1, 1, c边框透明度));
	m画图形->fs线条宽度(c边框宽度);
}
void C画边框::f更新() {
	m画图形->fs透明度(c边框透明度 * C抬显控制::fg全局透明度());
}
void C画边框::f画框架() const {
	if (m标准半宽 > c框架范围x) {
		//填满
		//m画图形->f填充矩形(t矩形::fc左上右下(c框架范围x, c框架范围y, m标准半宽, -c框架范围y));	//右
		//m画图形->f填充矩形(t矩形::fc左上右下(-m标准半宽, c框架范围y, -c框架范围x, -c框架范围y));	//左
		//边框
		m画图形->f填充矩形(t矩形::fc左上右下(c框架范围x, c外框架范围y, c外框架范围x, -c外框架范围y));	//右
		m画图形->f填充矩形(t矩形::fc左上右下(-c外框架范围x, c外框架范围y, -c框架范围x, -c外框架范围y));	//左
	} else if (m标准半高 > c框架范围y) {
		//填满
		//m画图形->f填充矩形(t矩形::fc左上右下(c框架范围x, m标准半高, -c框架范围x, c框架范围y));	//上
		//m画图形->f填充矩形(t矩形::fc左上右下(c框架范围x, -c框架范围y, -c框架范围x, -m标准半高));	//下
		//边框
		m画图形->f填充矩形(t矩形::fc左上右下(c外框架范围x, c外框架范围y, -c外框架范围x, c框架范围y));	//上
		m画图形->f填充矩形(t矩形::fc左上右下(c外框架范围x, -c框架范围y, -c外框架范围x, -c外框架范围y));	//下
	}
}
void C画边框::fs颜色(const t颜色 &a颜色) {
	m画图形->fs颜色(a颜色);
}
void C画边框::fs标准尺寸(float a宽, float a高) {
	m标准半宽 = a宽 * 0.5f;
	m标准半高 = a高 * 0.5f;
}
}	//namespace 东方山寨