#pragma once
#include "常量.h"
#include "图形基础.h"
#include "图形工厂.h"
namespace 东方山寨 {
//=============================================================================
// 图形层,包含图形对象
//=============================================================================
class C图形管理 {
public:
	C图形管理();
	void f初始化_环境(const C游戏速度 &);
	void f游戏外计算();
	void f游戏外更新();
	void f游戏外显示();
	C对象数组<I图形> &fg图形数组();
	C图形工厂 f工厂_图形();
	std::shared_ptr<C图形工厂> f工厂_图形p();
public:
	C图形工厂::C实现 m图形工厂实现;
	C对象数组<I图形> ma图形{c图形上限};
};
}	//namespace 东方山寨