#pragma once
#include <cflw数学_向量.h>
namespace 东方山寨 {
using t向量2 = cflw::数学::S向量2;
//==============================================================================
// 事件过程
//==============================================================================
class I事件 {
public:
	virtual void f事件_初始化();	//工厂创建对象并赋值后调用
	virtual void f事件_执行();	//每帧调用一次,可以与其它对象交互,小心数据竞争. 在 f接口_计算 之前调用
	virtual void f事件_结算();	//计算结束后调用,不与其它对象交互.用来避开并行计算过程中存在的顺序问题, 在 f接口_结算 之前调用
	virtual void f事件_销毁();	//即将从内存中销毁时调用. 在 f接口_销毁 之前调用
	virtual void f事件_结束();	//关卡事件结束时,敌机离场时
	virtual void f事件_击破();	//敌机被击破时调用
	virtual const t向量2 &f事件_g坐标() const;	//返回执行该事件的对象的中心坐标
};
}	//namespace 东方山寨