#include "子弹图形接口.h"
#include "子弹基础.h"
namespace 东方山寨 {
//--------------------------------------------------------------------------------
// 画子弹
//--------------------------------------------------------------------------------
//点
C子弹顶点::C点::C点(const C子弹 *p子弹) : m子弹(p子弹) {
}
//直线
C子弹顶点::C直线::C直线(const C子弹 *p子弹, int a数量) : m子弹{p子弹}, m数量{a数量} {
	m中心.m坐标 = p子弹->m坐标;
}
//曲线
C子弹顶点::C曲线::C曲线(const C子弹 *p子弹, int a数量) : m子弹{p子弹}, m数量{a数量} {
}
//网格
C子弹顶点::C网格::C网格(const C子弹 *p子弹, int p宽, int p高) : m子弹{p子弹}, m宽{p宽}, m高{p高} {
}
}