#include "敌机图形.h"
#include "敌机基础.h"
#include "图层.h"
namespace 东方山寨 {
//==============================================================================
// 道具制造机
//==============================================================================
C敌机图形_图片::C敌机图形_图片(const C敌机 &a对象, C缓冲数组<I图形缓冲> &aa图形缓冲):
	C对象图形<C敌机, C图片动画图形缓冲>(a对象, aa图形缓冲) {
	C图片动画图形::f初始化_父对象(&a对象);
	m图形缓冲->f初始化_图层((int)E图层::e敌机);
	m图形缓冲->f初始化_图形(*this);
}
void C敌机图形_图片::f计算() {
	m动画->f接口_动作(E动画动作::e水平移动, 数学::f取符号<float>(m对象->m速度.x, 1));
	m动画->f接口_计算();
}
void C敌机图形_图片::f更新() {
	m动画->f接口_更新();
	*m图形缓冲 = m动画->fg动画缓冲();
	m图形缓冲->m坐标 += m对象->m坐标;
}
const S图片动画属性 &C敌机图形_图片::fg图片动画属性() const {
	return *m对象->m敌机属性;
}
//==============================================================================
// 道具制造机
//==============================================================================
C敌机图形_线条::C敌机图形_线条(const C敌机 &a对象, C缓冲数组<I图形缓冲> &aa图形缓冲):
	C对象图形<C敌机, 图形::C圆形::C图形缓冲>(a对象, aa图形缓冲) {
	m图形缓冲->f初始化_图层((int)E图层::e敌机);
}
void C敌机图形_线条::f计算() {
}
void C敌机图形_线条::f更新() {
	m图形缓冲->m颜色 = t颜色::c白;
	m图形缓冲->m坐标 = m对象->m坐标;
	m图形缓冲->m半径 = 16;
}
}	//namespace 东方山寨