#include "游戏常量.h"
#include "玩家炸弹扩展.h"
#include "敌机基础.h"`
#include "游戏.h"
#include "图形引擎.h"
namespace 东方山寨::玩家炸弹 {
//==============================================================================
// 全屏清弹
//==============================================================================
C全屏清弹::C全屏清弹(float a半径, bool a道具, bool a伤害):
	C玩家炸弹(),
	m扩散速度(a半径) {
	m标志[C玩家子弹::e产生道具] = a道具;
	m标志[C玩家子弹::e伤害] = a伤害;
}
void C全屏清弹::f接口_计算() {
	const float v过秒 = m游戏速度->fg秒();
	m半径 += m扩散速度 * v过秒;
	m寿命 -= v过秒;
	if (m寿命 <= 0) {
		f对象_销毁();
	}
}
float C全屏清弹::f接口_g判定半径() const {
	return m半径;
}
//==============================================================================
// 风神录统一炸弹
//==============================================================================
void C风神录::f接口_计算() {
	const float v过秒 = m游戏速度->fg秒();
	m寿命 -= v过秒;
	if (m寿命 <= 0) {
		f对象_销毁();
		return;
	}
	C玩家子弹::f接口_计算();
}
void C风神录::f接口_初始化(const S玩家子弹参数 &a) {
	C玩家子弹::f接口_初始化(a);
	m速度 = t向量2(0, c速度y);
}
float C风神录::f接口_g判定半径() const {
	return c判定半径;
}
}	//namespace 东方山寨::玩家炸弹