#include "玩家炸弹基础.h"
#include "游戏.h"
#include "图形引擎.h"
namespace 东方山寨 {
//==============================================================================
// 玩家炸弹扩展
//==============================================================================
//void C玩家炸弹::f接口_显示() const {
//	auto &v画图形 = C游戏::fg图形().fg画图形();
//	v画图形.fs线条宽度(2);
//	v画图形.fs颜色({1, 1, 1, 0.5f});
//	v画图形.f绘制圆形(t圆形(m坐标, this->f接口_g判定半径()));
//}
float C玩家炸弹::f接口_g判定半径() const {
	return c判定半径;
}
bool C玩家炸弹::f接口_敌机判定(C敌机与玩家子弹判定 &a判定) {
	const t圆形 v判定圆{m坐标, this->f接口_g判定半径()};
	return a判定.f玩家子弹_提交判定(v判定圆);
}
bool C玩家炸弹::f接口_子弹判定(C子弹与玩家炸弹判定 &a判定) {
	const t圆形 v判定圆{m坐标, this->f接口_g判定半径()};
	return a判定.f炸弹_提交判定(v判定圆);
}
bool C玩家炸弹::f接口_i产生道具() const {
	return m标志[C玩家子弹::e产生道具];
}
void C玩家炸弹发射器::f接口_初始化() {
}
void C玩家炸弹发射器::f接口_计算() {
	if (m剩余时间 > 0) {
		this->f接口_产生子弹();
		f基础_复位();
	}
}
}	//namespace 东方山寨