#include "自机图形.h"
#include "自机.h"
namespace 东方山寨 {
//==============================================================================
// 自机图片
//==============================================================================
C自机图形_图片::C自机图形_图片(const C自机 &a对象, C缓冲数组<I图形缓冲> &aa图形缓冲):
	C对象图形<C自机, C图片动画图形缓冲>(a对象, aa图形缓冲) {
	C图片动画图形::f初始化_父对象(&a对象);
	m图形缓冲->f初始化_图层((int)E图层::e玩家);
	m图形缓冲->f初始化_图形(*this);
}
void C自机图形_图片::f计算() {
	m动画->f接口_动作(E动画动作::e水平移动, m对象->m移动.x);
	m动画->f接口_计算();
}
void C自机图形_图片::f更新() {
	m动画->f接口_更新();
	*m图形缓冲 = m动画->fg动画缓冲();
	m图形缓冲->m坐标 += m对象->m坐标;
	m图形缓冲->m透明度 *= m对象->fg透明度();
}
const S图片动画属性 &C自机图形_图片::fg图片动画属性() const {
	return *m对象->m自机属性;
}
//==============================================================================
// 自机线条
//==============================================================================
C自机图形_线条::C自机图形_线条(const C自机 &a对象, C缓冲数组<I图形缓冲> &aa图形缓冲):
	C对象图形<C自机, 图形::C十字::C图形缓冲>(a对象, aa图形缓冲) {
	m图形缓冲->f初始化_图层((int)E图层::e玩家);
	m图形缓冲->m半径 = 16;
	m图形缓冲->m线条宽度 = 2;
	m图形缓冲->m颜色 = t颜色::c白;
}
void C自机图形_线条::f计算() {
	m图形缓冲->m坐标 = m对象->m坐标;
}
void C自机图形_线条::f更新() {
}
}	//namespace 东方山寨