#include "程序常量.h"
#include "程序.h"
import 东方山寨.文件系统;
import 东方山寨.载入.内部;
import 东方山寨.载入.xml;
namespace 东方山寨::载入 {
//==============================================================================
// 总载入
//==============================================================================
void f载入() {
	const std::filesystem::path v载入文件 = c启动文件;
	xml::t文档 v文档;
	xml::C读取::f读取(v文档, v载入文件);
	xml::t节点 v根 = v文档.child(L"根");
	xml::C载入::f汇总({v根, v载入文件});
	C内部载入::f图形管线();
	//C内部载入::f子机();
	C内部载入::f玩家子弹发射();
	C内部载入::f道具();
	C内部载入::f动画();
	C内部载入::f模型();
	C内部载入::f关卡组();
	C程序::fs游戏标志((int)E游戏标志::e载入0);
}
}	//namespace 东方山寨::载入