#include "边框基础.h"
#include "边框常量.h"
#include "游戏.h"
#include "图形引擎.h"
#include "图形_画边框.h"
#include "边框形状.h"
namespace 东方山寨 {
//==============================================================================
// 边框基础
//==============================================================================
C边框管理::C边框管理():
	m边框(&边框::C矩形::c标准) {
}
void C边框管理::f计算() {

}
void C边框管理::f显示() const {
	auto &v画边框 = C游戏::fg图形().fg画边框();
	S画边框参数 v参数 = {*v画边框.m画图形, 0};
	m边框->f显示(v参数);
}
void C边框管理::f切换边框(const I边框 &a边框) {
	m边框 = &a边框;
}
}	//namespace 东方山寨